x =-1*[-4 -2 0 -4 -6 -4 -2 -4 -6 -6 -4 -4 -6 -6 -2 6 12 8 0 -16 -38 -60 -84 -90 -66 -32 -4 -2 -4 8 12 12 10 6 6 6 4 0 0 0 0 0 -2 -4 0 0 0 -2 -2 0 0 -2 -2 -2 -2 0];                %总采样长度
X=repmat(x,1,12);%将目标函数重复12遍
N=length(X);%测量个数
t=0:N-1;    
A=30;%设置参数
Y=A*sin(2*pi*t*60/1000);%噪声信号
W=X+Y;%引入正弦干扰的原始输入
M=10*sin(2*pi*t*60/1000);%噪声参考信号
w1=0.1;%加权矢量，滤波器初值
e=zeros(1,N);%创建误差矩阵（1*N）
u=0.0001;%步数
for i=1:N      %LMS算法
    y=w(i)*M(i);%近似目标噪声信号
    e(i)=W(i)-y;%滤波
    R(i)=X(i)-e(i);%误差计算
    w(i+1)=w(i)+2*u*e(i)*M(i);%更新滤波器系数
end
subplot(411);plot(t,X);
subplot(412);plot(t,W);
subplot(413);plot(t,e);
subplot(414);plot(t,R);%绘图程序